In [1]:
import pandas as pd
import numpy as np

In [2]:
s=pd.Series([1,2,3,4,5,6,np.nan,8,9,10])
s

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [3]:
d=pd.date_range('20210928',periods=10)
d

DatetimeIndex(['2021-09-28', '2021-09-29', '2021-09-30', '2021-10-01',
               '2021-10-02', '2021-10-03', '2021-10-04', '2021-10-05',
               '2021-10-06', '2021-10-07'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df=pd.DataFrame(np.random.randn(10,4), index=d, columns=['A','B','C','D'])
df

                   A         B         C         D
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-09-30 -0.139589  0.199404 -0.468859  0.945935
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373
2021-10-02  0.314512  0.762867 -1.032447 -1.179826
2021-10-03  0.655680  0.145244  1.195596  1.098136
2021-10-04  0.773623 -0.190251 -1.690923 -0.382938
2021-10-05  1.096197 -0.646810 -0.532290 -0.179429
2021-10-06  0.150487  1.442946  1.514626 -0.098387
2021-10-07  1.405334 -0.597030 -0.113561  2.191665

In [5]:
df1=pd.DataFrame({'A':[1,2,3,4],
                  'B':pd.Timestamp('20210928'),
                  'C':pd.Series(1, index=list(range(4)),dtype='float32'),
                  'D':np.array([5]*4,dtype='int32'),
                  'E':pd.Categorical(['true','false','true','false']),
                  'F':'pandas'})
df1

   A          B    C  D      E       F
0  1 2021-09-28  1.0  5   true  pandas
1  2 2021-09-28  1.0  5  false  pandas
2  3 2021-09-28  1.0  5   true  pandas
3  4 2021-09-28  1.0  5  false  pandas

In [6]:
df1.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [8]:
df.head()
#view the data it will gives the firtst 5 values

                   A         B         C         D
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-09-30 -0.139589  0.199404 -0.468859  0.945935
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373
2021-10-02  0.314512  0.762867 -1.032447 -1.179826

In [9]:
df.tail()

                   A         B         C         D
2021-10-03  0.655680  0.145244  1.195596  1.098136
2021-10-04  0.773623 -0.190251 -1.690923 -0.382938
2021-10-05  1.096197 -0.646810 -0.532290 -0.179429
2021-10-06  0.150487  1.442946  1.514626 -0.098387
2021-10-07  1.405334 -0.597030 -0.113561  2.191665

In [10]:
df.index

DatetimeIndex(['2021-09-28', '2021-09-29', '2021-09-30', '2021-10-01',
               '2021-10-02', '2021-10-03', '2021-10-04', '2021-10-05',
               '2021-10-06', '2021-10-07'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.to_numpy()

array([[-0.14218936, -1.14497821, -1.33442632,  0.60575354],
       [ 1.51157905, -1.24368634,  0.03299832,  0.1387732 ],
       [-0.13958913,  0.19940374, -0.46885919,  0.94593531],
       [-0.97027065, -1.06545781,  2.07787926, -1.79537252],
       [ 0.3145119 ,  0.76286653, -1.03244695, -1.17982641],
       [ 0.65568009,  0.1452444 ,  1.19559602,  1.09813565],
       [ 0.77362269, -0.19025113, -1.69092276, -0.38293835],
       [ 1.09619671, -0.64681029, -0.53229005, -0.17942946],
       [ 0.15048673,  1.44294624,  1.51462603, -0.0983874 ],
       [ 1.4053344 , -0.59703033, -0.11356055,  2.19166466]])

In [13]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.465536  -0.233775  -0.035141   0.134431
std     0.776412   0.880804   1.258384   1.150528
min    -0.970271  -1.243686  -1.690923  -1.795373
25%    -0.067070  -0.960796  -0.907408  -0.332061
50%     0.485096  -0.393641  -0.291210   0.020193
75%     1.015553   0.185864   0.904947   0.860890
max     1.511579   1.442946   2.077879   2.191665

In [14]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2021-09-28  0.605754 -1.334426 -1.144978 -0.142189
2021-09-29  0.138773  0.032998 -1.243686  1.511579
2021-09-30  0.945935 -0.468859  0.199404 -0.139589
2021-10-01 -1.795373  2.077879 -1.065458 -0.970271
2021-10-02 -1.179826 -1.032447  0.762867  0.314512
2021-10-03  1.098136  1.195596  0.145244  0.655680
2021-10-04 -0.382938 -1.690923 -0.190251  0.773623
2021-10-05 -0.179429 -0.532290 -0.646810  1.096197
2021-10-06 -0.098387  1.514626  1.442946  0.150487
2021-10-07  2.191665 -0.113561 -0.597030  1.405334

In [15]:
df.sort_values(by='C')

                   A         B         C         D
2021-10-04  0.773623 -0.190251 -1.690923 -0.382938
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-10-02  0.314512  0.762867 -1.032447 -1.179826
2021-10-05  1.096197 -0.646810 -0.532290 -0.179429
2021-09-30 -0.139589  0.199404 -0.468859  0.945935
2021-10-07  1.405334 -0.597030 -0.113561  2.191665
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-10-03  0.655680  0.145244  1.195596  1.098136
2021-10-06  0.150487  1.442946  1.514626 -0.098387
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373

In [16]:
df['C']

2021-09-28   -1.334426
2021-09-29    0.032998
2021-09-30   -0.468859
2021-10-01    2.077879
2021-10-02   -1.032447
2021-10-03    1.195596
2021-10-04   -1.690923
2021-10-05   -0.532290
2021-10-06    1.514626
2021-10-07   -0.113561
Freq: D, Name: C, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-09-30 -0.139589  0.199404 -0.468859  0.945935

In [18]:
df.loc[d[0]]

#location ,,,0th location ulla 0th row ulla

A   -0.142189
B   -1.144978
C   -1.334426
D    0.605754
Name: 2021-09-28 00:00:00, dtype: float64

In [19]:
df.loc[:,['A','C']]

                   A         C
2021-09-28 -0.142189 -1.334426
2021-09-29  1.511579  0.032998
2021-09-30 -0.139589 -0.468859
2021-10-01 -0.970271  2.077879
2021-10-02  0.314512 -1.032447
2021-10-03  0.655680  1.195596
2021-10-04  0.773623 -1.690923
2021-10-05  1.096197 -0.532290
2021-10-06  0.150487  1.514626
2021-10-07  1.405334 -0.113561

In [20]:
df.loc['20210928':'20211003',['D','C']]

                   D         C
2021-09-28  0.605754 -1.334426
2021-09-29  0.138773  0.032998
2021-09-30  0.945935 -0.468859
2021-10-01 -1.795373  2.077879
2021-10-02 -1.179826 -1.032447
2021-10-03  1.098136  1.195596

In [21]:
df.loc['20210928',['D','C']]

D    0.605754
C   -1.334426
Name: 2021-09-28 00:00:00, dtype: float64

In [22]:

df.loc[d[0],['D','C']]

D    0.605754
C   -1.334426
Name: 2021-09-28 00:00:00, dtype: float64

In [23]:
df.at[d[0],'C']

-1.3344263182882565

In [24]:
df.iloc[3]

A   -0.970271
B   -1.065458
C    2.077879
D   -1.795373
Name: 2021-10-01 00:00:00, dtype: float64

In [25]:
df.iloc[3:5]

                   A         B         C         D
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373
2021-10-02  0.314512  0.762867 -1.032447 -1.179826

In [26]:
df.iloc[3:5 ,0:2]

                   A         B
2021-10-01 -0.970271 -1.065458
2021-10-02  0.314512  0.762867

In [27]:
df[df['A']>0]

                   A         B         C         D
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-10-02  0.314512  0.762867 -1.032447 -1.179826
2021-10-03  0.655680  0.145244  1.195596  1.098136
2021-10-04  0.773623 -0.190251 -1.690923 -0.382938
2021-10-05  1.096197 -0.646810 -0.532290 -0.179429
2021-10-06  0.150487  1.442946  1.514626 -0.098387
2021-10-07  1.405334 -0.597030 -0.113561  2.191665

In [28]:
df[df['A']>2]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [29]:
df[df['A']>3]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [30]:
df2=df.reindex(index=d[0:4],columns=list(df.columns)+['E'])
df2.loc[d[0]:d[1],'E']=1

In [31]:
df2

                   A         B         C         D    E
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754  1.0
2021-09-29  1.511579 -1.243686  0.032998  0.138773  1.0
2021-09-30 -0.139589  0.199404 -0.468859  0.945935  NaN
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373  NaN

In [32]:
df2.dropna()

                   A         B         C         D    E
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754  1.0
2021-09-29  1.511579 -1.243686  0.032998  0.138773  1.0

In [33]:
df2.fillna(value=2)

                   A         B         C         D    E
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754  1.0
2021-09-29  1.511579 -1.243686  0.032998  0.138773  1.0
2021-09-30 -0.139589  0.199404 -0.468859  0.945935  2.0
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373  2.0

In [34]:

df.mean()

A    0.465536
B   -0.233775
C   -0.035141
D    0.134431
dtype: float64

In [35]:

s=pd.Series([1,2,3,np.nan,4,5,6,7,8,9],index=d).shift(2)
s

2021-09-28    NaN
2021-09-29    NaN
2021-09-30    1.0
2021-10-01    2.0
2021-10-02    3.0
2021-10-03    NaN
2021-10-04    4.0
2021-10-05    5.0
2021-10-06    6.0
2021-10-07    7.0
Freq: D, dtype: float64

In [36]:
df.sub(s, axis='index')

                   A         B         C         D
2021-09-28       NaN       NaN       NaN       NaN
2021-09-29       NaN       NaN       NaN       NaN
2021-09-30 -1.139589 -0.800596 -1.468859 -0.054065
2021-10-01 -2.970271 -3.065458  0.077879 -3.795373
2021-10-02 -2.685488 -2.237133 -4.032447 -4.179826
2021-10-03       NaN       NaN       NaN       NaN
2021-10-04 -3.226377 -4.190251 -5.690923 -4.382938
2021-10-05 -3.903803 -5.646810 -5.532290 -5.179429
2021-10-06 -5.849513 -4.557054 -4.485374 -6.098387
2021-10-07 -5.594666 -7.597030 -7.113561 -4.808335

In [37]:
df

                   A         B         C         D
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-09-29  1.511579 -1.243686  0.032998  0.138773
2021-09-30 -0.139589  0.199404 -0.468859  0.945935
2021-10-01 -0.970271 -1.065458  2.077879 -1.795373
2021-10-02  0.314512  0.762867 -1.032447 -1.179826
2021-10-03  0.655680  0.145244  1.195596  1.098136
2021-10-04  0.773623 -0.190251 -1.690923 -0.382938
2021-10-05  1.096197 -0.646810 -0.532290 -0.179429
2021-10-06  0.150487  1.442946  1.514626 -0.098387
2021-10-07  1.405334 -0.597030 -0.113561  2.191665

In [38]:
df.apply(np.cumsum)

                   A         B         C         D
2021-09-28 -0.142189 -1.144978 -1.334426  0.605754
2021-09-29  1.369390 -2.388665 -1.301428  0.744527
2021-09-30  1.229801 -2.189261 -1.770287  1.690462
2021-10-01  0.259530 -3.254719  0.307592 -0.104910
2021-10-02  0.574042 -2.491852 -0.724855 -1.284737
2021-10-03  1.229722 -2.346608  0.470741 -0.186601
2021-10-04  2.003345 -2.536859 -1.220182 -0.569540
2021-10-05  3.099541 -3.183669 -1.752472 -0.748969
2021-10-06  3.250028 -1.740723 -0.237846 -0.847356
2021-10-07  4.655362 -2.337753 -0.351406  1.344308

In [39]:
df.apply(lambda x: x.min())

A   -0.970271
B   -1.243686
C   -1.690923
D   -1.795373
dtype: float64

In [40]:
s.value_counts

<bound method IndexOpsMixin.value_counts of 2021-09-28    NaN
2021-09-29    NaN
2021-09-30    1.0
2021-10-01    2.0
2021-10-02    3.0
2021-10-03    NaN
2021-10-04    4.0
2021-10-05    5.0
2021-10-06    6.0
2021-10-07    7.0
Freq: D, dtype: float64>

In [41]:
s=pd.Series(['pandas','python','jupiter',np.nan,'java','colab'])
s.str.upper()

0     PANDAS
1     PYTHON
2    JUPITER
3        NaN
4       JAVA
5      COLAB
dtype: object

In [42]:
df=pd.DataFrame(np.random.randn(10,4))

In [43]:
df

          0         1         2         3
0  0.006948  0.898019 -1.670929  1.167987
1  0.615237  0.862022  0.758871 -0.868956
2  2.027637 -1.191758 -0.996979 -1.879270
3 -0.078633  0.848965 -1.744467 -0.712201
4 -1.548665  0.818901 -1.124137  1.231444
5  0.825040  0.248813 -0.376709  0.402020
6 -0.407881  1.764222  1.381600  0.523955
7  0.346814  0.619904  0.915781  0.291319
8  1.227742  0.628264 -1.326143 -0.661064
9  1.239500  0.989572 -1.179789 -0.945737

In [44]:
df2=[df[:3],df[3:7],df[7:]]

In [45]:
df2

[          0         1         2         3
 0  0.006948  0.898019 -1.670929  1.167987
 1  0.615237  0.862022  0.758871 -0.868956
 2  2.027637 -1.191758 -0.996979 -1.879270,
           0         1         2         3
 3 -0.078633  0.848965 -1.744467 -0.712201
 4 -1.548665  0.818901 -1.124137  1.231444
 5  0.825040  0.248813 -0.376709  0.402020
 6 -0.407881  1.764222  1.381600  0.523955,
           0         1         2         3
 7  0.346814  0.619904  0.915781  0.291319
 8  1.227742  0.628264 -1.326143 -0.661064
 9  1.239500  0.989572 -1.179789 -0.945737]

In [46]:

pd.concat(df2)

          0         1         2         3
0  0.006948  0.898019 -1.670929  1.167987
1  0.615237  0.862022  0.758871 -0.868956
2  2.027637 -1.191758 -0.996979 -1.879270
3 -0.078633  0.848965 -1.744467 -0.712201
4 -1.548665  0.818901 -1.124137  1.231444
5  0.825040  0.248813 -0.376709  0.402020
6 -0.407881  1.764222  1.381600  0.523955
7  0.346814  0.619904  0.915781  0.291319
8  1.227742  0.628264 -1.326143 -0.661064
9  1.239500  0.989572 -1.179789 -0.945737

In [47]:
#left joining
left=pd.DataFrame({'A':[1,2],'B':[3,4]})

In [48]:
left

   A  B
0  1  3
1  2  4

In [49]:
right=pd.DataFrame({'A':[3,2],'D':[4,5]})

In [50]:
right

   A  D
0  3  4
1  2  5

In [51]:
pd.merge(left,right,on='A')

   A  B  D
0  2  4  5

In [52]:
df.groupby([2,3]).sum()

                            0         1
2         3
-1.744467 -0.712201 -0.078633  0.848965
-1.670929  1.167987  0.006948  0.898019
-1.326143 -0.661064  1.227742  0.628264
-1.179789 -0.945737  1.239500  0.989572
-1.124137  1.231444 -1.548665  0.818901
-0.996979 -1.879270  2.027637 -1.191758
-0.376709  0.402020  0.825040  0.248813
 0.758871 -0.868956  0.615237  0.862022
 0.915781  0.291319  0.346814  0.619904
 1.381600  0.523955 -0.407881  1.764222

In [53]:

my_tuple=list(zip(*[[1,2,3,4,5,17,18,19],[11,12,13,6,7,8,9,10]])) #zip function to use the 2 list can concatinate to
index=pd.MultiIndex.from_tuples(my_tuple,names=['first','Second']) #multiindex used to 2 index
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])
df2=df[:2]
df2

                     A         B
first Second
1     11     -0.549282  1.446457
2     12     -1.179000  3.071704

In [54]:
df2.stack()

#arrange the datas in a order

first  Second
1      11      A   -0.549282
               B    1.446457
2      12      A   -1.179000
               B    3.071704
dtype: float64

In [55]:
#un arrainge the datas in 
df2.unstack()

               A                B
Second        11     12        11        12
first
1      -0.549282    NaN  1.446457       NaN
2            NaN -1.179       NaN  3.071704

In [56]:
df=pd.DataFrame({'A':['a','b','c','d']*3,
                'B':['A','B','C']*4,
                'C':['P','P','P','Q','Q','Q']*2,
                'D':np.random.randn(12),
                'E':np.random.randn(12)})

In [57]:
df

    A  B  C         D         E
0   a  A  P -1.332311  1.353528
1   b  B  P  1.314444  0.374620
2   c  C  P -0.990116 -1.381436
3   d  A  Q -2.053025  1.026497
4   a  B  Q  1.595951  1.911452
5   b  C  Q -0.157243  0.251482
6   c  A  P  0.114572 -0.185861
7   d  B  P -0.379716  1.425904
8   a  C  P  0.490715  0.971821
9   b  A  Q -0.727196 -0.560716
10  c  B  Q -0.455231  0.735347
11  d  C  Q  0.338514  0.113870

In [58]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

#

C           P         Q
A B
a A -1.332311       NaN
  B       NaN  1.595951
  C  0.490715       NaN
b A       NaN -0.727196
  B  1.314444       NaN
  C       NaN -0.157243
c A  0.114572       NaN
  B       NaN -0.455231
  C -0.990116       NaN
d A       NaN -2.053025
  B -0.379716       NaN
  C       NaN  0.338514

In [59]:

dates=pd.date_range('30/09/2021, 00:00',periods=5,freq='S')
dates

DatetimeIndex(['2021-09-30 00:00:00', '2021-09-30 00:00:01',
               '2021-09-30 00:00:02', '2021-09-30 00:00:03',
               '2021-09-30 00:00:04'],
              dtype='datetime64[ns]', freq='S')

In [60]:
ts=pd.Series(np.random.randint(len(dates)),dates)

In [61]:
ts

2021-09-30 00:00:00    3
2021-09-30 00:00:01    3
2021-09-30 00:00:02    3
2021-09-30 00:00:03    3
2021-09-30 00:00:04    3
Freq: S, dtype: int64

In [62]:
ts_utc=ts.tz_localize('UTC')
ts_utc

2021-09-30 00:00:00+00:00    3
2021-09-30 00:00:01+00:00    3
2021-09-30 00:00:02+00:00    3
2021-09-30 00:00:03+00:00    3
2021-09-30 00:00:04+00:00    3
Freq: S, dtype: int64

In [63]:
ts_utc.tz_convert('US/Eastern')

2021-09-29 20:00:00-04:00    3
2021-09-29 20:00:01-04:00    3
2021-09-29 20:00:02-04:00    3
2021-09-29 20:00:03-04:00    3
2021-09-29 20:00:04-04:00    3
Freq: S, dtype: int64

In [64]:
dates=pd.date_range('30/09/2021',periods=5,freq='M')
dates

C:\Users\afsal\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3369: UserWarning: Parsing '30/09/2021' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  exec(code_obj, self.user_global_ns, self.user_ns)

DatetimeIndex(['2021-09-30', '2021-10-31', '2021-11-30', '2021-12-31',
               '2022-01-31'],
              dtype='datetime64[ns]', freq='M')

In [65]:
ts=pd.Series(np.random.randint(len(dates)),dates)
ts

2021-09-30    0
2021-10-31    0
2021-11-30    0
2021-12-31    0
2022-01-31    0
Freq: M, dtype: int64

In [66]:
ps=ts.to_period()

In [67]:
ps

2021-09    0
2021-10    0
2021-11    0
2021-12    0
2022-01    0
Freq: M, dtype: int64

In [68]:
ps.to_timestamp()

2021-09-01    0
2021-10-01    0
2021-11-01    0
2021-12-01    0
2022-01-01    0
Freq: MS, dtype: int64

In [69]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],
                "grade":['a','b','c','b','a','e']})

In [70]:
df

   id grade
0   1     a
1   2     b
2   3     c
3   4     b
4   5     a
5   6     e

In [71]:
df['Grade']=df['grade'].astype('category')
df['Grade']

0    a
1    b
2    c
3    b
4    a
5    e
Name: Grade, dtype: category
Categories (4, object): ['a', 'b', 'c', 'e']

In [72]:
df['Grade'].categories=['good','very bad','very good','exelent']
df

   id grade Grade
0   1     a     a
1   2     b     b
2   3     c     c
3   4     b     b
4   5     a     a
5   6     e     e

In [73]:
df['Grade']=df['Grade'].cat.set_categories(['very good','bad','very bad','good'])

In [74]:
df['Grade']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: Grade, dtype: category
Categories (4, object): ['very good', 'bad', 'very bad', 'good']

In [75]:
ps=ts.to_period()

In [76]:
ps

2021-09    0
2021-10    0
2021-11    0
2021-12    0
2022-01    0
Freq: M, dtype: int64

In [77]:
ps.to_timestamp()

2021-09-01    0
2021-10-01    0
2021-11-01    0
2021-12-01    0
2022-01-01    0
Freq: MS, dtype: int64

In [84]:
df=pd.DataFrame({'id':[1,2,3,4,5,6],
                 'Grade':['a','b','c','b','a','e']})

In [85]:
df

   id Grade
0   1     a
1   2     b
2   3     c
3   4     b
4   5     a
5   6     e

In [86]:
df['grade']=df['Grade'].astype('category')
df['grade']

0    a
1    b
2    c
3    b
4    a
5    e
Name: grade, dtype: category
Categories (4, object): ['a', 'b', 'c', 'e']

In [87]:
df['grade'].cat.categories=['good','very bad','very good','exelent']

In [88]:
df['grade']=df['grade'].cat.set_categories(['very good','bad','very bad','good','medium'])
df['grade']

0         good
1     very bad
2    very good
3     very bad
4         good
5          NaN
Name: grade, dtype: category
Categories (5, object): ['very good', 'bad', 'very bad', 'good', 'medium']

In [89]:
df

   id Grade      grade
0   1     a       good
1   2     b   very bad
2   3     c  very good
3   4     b   very bad
4   5     a       good
5   6     e        NaN